// 多条删除前，checkbox选择数量为0时的消息
var MSG_0001 = "请选择行删除。";

// 教师选择页面（POPUP），点击确定时，未选择数据时的消息
var MSG_0002 = "请选择教师。";

// 专业方向选择页面（POPUP），点击确定时，未选择数据时的消息
var MSG_0003 = "请选择专业方向。";

// 专业方向选择页面（POPUP），选择数量超过5个时
var MSG_0004 = "您最多能选择5个项。";

// 请输入版权信息
var MSG_0005 = "请输入版权信息。";

// 版权信息不能超过300个字符
var MSG_0006 = "版权信息不能超过300个字符。";

// 未选择导入文件。
var MSG_0007 = "未选择导入文件。";

//多条删除前，checkbox选择数量为0时的消息
var MSG_0008 = "请至少选择一行数据。";

//实训室选择页面（POPUP），点击确定时，未选择数据时的消息
var MSG_0009 = "请选择一个实训室。";

// 确定要保存吗。
var MSG_0010 = "确定要保存吗?";

// 确定要删除吗。
var MSG_0011 = "确定要删除吗?";

// 任务书已经发放。<br>确定需要重新发放任务书吗。
var MSG_0012 = "任务书已经发放。<br>确定需要重新发放任务书吗?";

// 资源上传页面,请至少上传一个资源。
var MSG_0013 = "请上传资源。";

// 最多能选择9张图片。
var MSG_0014 = "最多能选择9张图片。";

// 上传文件不能超过5M。
var MSG_0015 = "上传文件大小不能超过5M。";

// 上传文件不能超过20M。
var MSG_0016 = "上传文件大小不能超过20M。";

// 请至少选择一个班级进行查询。
var MSG_0017 = "请至少选择一个班级进行查询。";

// 请选择实习指导工作报告文件。
var MSG_0018 = "请选择实习指导工作报告文件。";

// 请选择走访记录文件。
var MSG_0019 = "请选择走访记录文件。";

// 请选择实习指导总结报告文件。
var MSG_0020 = "请选择实习指导总结报告文件。";

// 请选择顶岗实习计划报告文件。
var MSG_0021 = "请选择顶岗实习计划报告文件。";

// 确定要公开吗。
var MSG_0022 = "确定要公开吗?";

//确定要关闭吗。
var MSG_0023 = "确定要关闭吗?";

// 请选择收信人。
var MSG_0024 = "请选择收信人。";

//请至少选择一个班级
var MSG_0025 = "请选择班级。";

// 确定要恢复上课吗？
var MSG_0026 = "确定要恢复上课吗？";

// 确定要授权实训室管理员修改这条数据吗？
var MSG_0027 = "确定要授权修改这条数据吗？";

// 确定要取消实训室管理员对这条数据修改的授权吗？
var MSG_0028 = "确定要取消对这条数据修改的授权吗？";

// 请选择您要查询的实训室
var MSG_0029 = "请选择您要查询的实训室。";

// 请选择要导出日志的实训室。
var MSG_0030 = "请选择一个实训室进行日志导出。";

// 录入的数据中有无效数据。
var MSG_0031 = "录入的数据中有无效数据。";

//资产编号重复,请确认。
var MSG_0032 = "资产编号重复,请确认。";

// 请录入数据
var MSG_0033 = "请录入数据。";

// 易耗品编号重复,请确认。
var MSG_0034 = "您已经选择了该易耗品,请确认。";

// 低值品编号重复,请确认。
var MSG_0035 = "您已经选择了该低值品,请确认。";

//请评分
var MSG_0036 = "请评分。";

//不可选择当前实训室 ，请重新选择！
var MSG_0037 = "不可选择当前实训室 ，请重新选择！";

// 最多只能增加{?0}个{?1}！
var MSG_0038 = "最多只能增加$0个$1！";

// 最多只能选择6个公司标签！
var MSG_0039 = "最多只能选择6个公司标签！";

// 单次只能选择5个文件！
var MSG_0040 = "单次只能选择5个文件！";

//首次登录需在登录页登录并修改密码！
var MSG_0041 = "首次登录需在登录页修改密码！";

// 资源重复。
var MSG_0042 = "资源重复。";

// 不能选择重复的语言能力。
var MSG_0043 = "请选择不同的[语言能力]。";

// 已输入的列表将被清空,确定要变换实训室吗？
var MSG_0044 = "已输入的内容将被清空,确定要变换实训室吗？";

// 不能选择自己,请重新选择！
var MSG_0045 = "不能选择自己,请重新选择！";

// 请至少增加一个选项答案。
var MSG_0046 = "请增加选项答案。";

// 请至少增加一个选项问题。
var MSG_0047 = "请增加选项问题。";

// 请至少增加一个选项问题。
var MSG_0048 = "app组课单节只能选择一个视频文件。";

// 您已参加过该调查。
var MSG_0049 = "您已参加过该调查。";

// 有文件正在上传中，请耐心等待。
var MSG_0050 = "有文件正在上传，请耐心等待。";

// 发送后无法删除或修改。<br/>确定要发送站内信吗?
var MSG_0051 = "发送后无法删除或修改。<br/>确定要发送站内信吗?";

// 关于我们不能超过5000个字符
var MSG_0052 = "输入内容不能超过2000个字符。";

// 请选择报名人员！
var MSG_0055 = "请选择报名人员！";

// 请选择LOGO图片！
var MSG_0056 = "请选择LOGO图片！";

// 您还没有评分
var MSG_0057 = "您还没有评分！";

// 您还没有选择文件上传！
var MSG_0058 = "您还没有选择文件上传！";

// 上传文件格式不正确，请重新上传！
var MSG_0059 = "上传文件格式不正确，请重新上传！";

// 模板文件还没有上传，请联系教务处！
var MSG_0060 = "模板文件还没有上传，请联系教务处！";

// 结束后将无法恢复，确定要结束本次工作下发吗？
var MSG_0061 = "结束后将无法恢复，确定要结束本次工作下发吗？";

// 请选择附件上传!
var MSG_0062 = "请选择附件上传!";

// 请选择门类!
var MSG_0063 = "请选择门类!";

// 请选择学科!
var MSG_0064 = "请选择学科!";

//易耗品名称重复,请确认。
var MSG_0065 = "易耗品名称重复,请确认。";

// 专题明细不存在。
var MSG_0066 = "专题明细不存在。";

// 专题内容不存在。
var MSG_0067 = "专题内容不存在。";

//请选择行授权。
var MSG_0068 = "请选择行授权。";

//请选择实习企业。
var MSG_0069 = "请选择实习企业。";

//实习企业不能为空，请学生重新申请。
var MSG_0070 = "实习企业不能为空，请学生重新申请。";

//请选择组长。
var MSG_0071 = "请选择组长。";

//请选择组员。
var MSG_0072 = "请选择组员。";

//组内成员有重复，请重新选择。
var MSG_0073 = "组内成员有重复，请重新选择。";

//确定要验证吗。
var MSG_0074 = "确定要验证吗?";

//请选择调查范围
var MSG_0075 = "请选择调查范围。";

//请选择企业。
var MSG_0076 = "请选择企业。";

//请填写拒绝理由。
var MSG_0077 = "请填写拒绝理由。";

//请选择实习种类。
var MSG_0078 = "请选择实习种类。";

//实习阶段已经归档。
var MSG_0079 = "实习阶段已经归档，不能进行当前操作。";

//确定设置该角色为默认角色吗？
var MSG_0080 = "确定设置该角色为默认角色吗？";

//确定撤回请假申请吗？
var MSG_0081 = "确定撤回请假申请吗？";

// 请先选择班级。
var MSG_0082 = "请先选择班级。";

// 开始复制后会覆盖原有的分配数据，是否确定复制？
var MSG_0083 = "开始复制后会覆盖原有的分配数据，是否确定复制？";

// 此实习阶段已经上传实习报告，不可多次上传。
var MSG_0084 = "此实习阶段已经上传实习报告，不可多次上传。";

// 工作流-请至少选择一个审批者。
var WF_MSG_0001 = "请选择审批者。";

// 工作流-请至少选择一个参与者。
var WF_MSG_0002 = "请选择参与者。";

// 请至少选择一个模板文件
var WF_MSG_0003 = "请选择模板文件。";

// 请至少选择一个发起者。
var WF_MSG_0004 = "请选择发起者。";
